Tasks/ЗадачиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Task>
		<Properties>
			<Name>ЗадачиПользователя</Name>
			<Comment>Общие рабочие поручения и персональные задания</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АттестацияРабочихМестДляУчетаСпецстажа</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеПараметровРасчетаИндексацииПоДолжностям</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеПланируемыхПоступленийДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Опрос</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.Приложение2КНалоговойНакладной</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаОжидаемогоИПодтвержденногоНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковПоЗарплате</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаменыОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.Приложение1КНалоговойНакладной</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеКоммунальногоНалога</v8:Type>
						<v8:Type>cfg:DocumentRef.УсловияПоставокПоДоговорамКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланируемоеПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровОтданныхНаКомиссию</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводВЭксплуатациюОС</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаОстатковНКУна01042011</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеАнкет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПокупкуПродажуВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеВзаиморасчетовСКонтрагентамиВ1ДФ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаСкидокНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПеремещениеНаличныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеНалоговогоНазначенияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаДолейРаспределенияПоПроектам</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.УпрРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.Доверенность</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводСведенийОПлановыхНачисленияхУдержаниях</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РезервированиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеСпособовОтраженияРасходовПоАмортизацииНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартияМалоценкиВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеКадровогоПлана</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.ПокупкаПродажаВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеГрафиковАмортизацииОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаВнутреннегоЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
						<v8:Type>cfg:DocumentRef.КлассификацияПокупателейПоСтадиямВзаимоотношений</v8:Type>
						<v8:Type>cfg:DocumentRef.УпрПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеШтатногоРасписанияОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетКоэффициентовДляЗаполненияПриложенияСВДекларацииПоПрибыли</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерерасчетПропорциональногоНДСпоТоварамИОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеПлатежныхДокументовПоВзносамВФонды</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьЗаменыРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаГарантийныхСроковНалоговыйУчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеСостоянияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеРасчетВФСС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаМалоценкиВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыгрузкаРегламентированныхОтчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаКоэффициентаПропорциональногоОтнесенияНДСНаКредит</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеВнутреннихЗаказов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
						<v8:Type>cfg:DocumentRef.УпрОбменВалют</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬРемонтОС</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыИОдноразовыеВыплатыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланЗакупок</v8:Type>
						<v8:Type>cfg:DocumentRef.Сервис</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковМалоценкиВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеЗаявокНаРасходованиеСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьКорректировкаИспользованияРаботникамиРабочегоВремени</v8:Type>
						<v8:Type>cfg:DocumentRef.НалоговаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаСкидокНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровПринятыхНаКомиссию</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаТарифов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровОтданныхНаКомиссию</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСерийИХарактеристикТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеПотребностей</v8:Type>
						<v8:Type>cfg:DocumentRef.НормированиеРасходовПоНалогуНаПрибыль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеНаПрименениеЛьготы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеВыплатФСС</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаДиапазоновБазовыхЦен</v8:Type>
						<v8:Type>cfg:DocumentRef.РазмещениеЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаписейРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеИзОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаЗначенийТочкиЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНЗП</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеЗаказовПоставщикам</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаПороговНакопительныхСкидок</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОборудованияВМонтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетыПоНалогуНаПрибыль</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияАвансовВНалоговомУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеМалоценкиИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыработкаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбъявлениеНаВзносНаличными</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияРасчетовСконтрагентами</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеПараметровНачисленияАмортизацииНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводСведенийОБанковскихКарточкахРаботников</v8:Type>
						<v8:Type>cfg:DocumentRef.СправкаОДоходах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводСведенийОбИндексированномДоходе</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровВРознице</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаПорядкаЗакрытияПодразделений</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратНаРаботуОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочиеЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.ДенежныйЧек</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеМалоценкиВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДепонентовВДоходыОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияВходящегоНалоговогоДокумента</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.УпрВнутреннееПеремещениеНаличныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеНалоговогоНазначенияЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоТребованииНакладной</v8:Type>
						<v8:Type>cfg:DocumentRef.ИндексацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаКачестваТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеПараметровНачисленияАмортизацииОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетСпецстажаРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатурыКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеЗаказовПокупателей</v8:Type>
						<v8:Type>cfg:DocumentRef.ОпределениеФинансовыхРезультатов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыработкаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаНаценокПоУсловиямПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровоеПеремещениеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнительныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеНалоговогоНазначенияТЗР</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеЛимитовВозвратнойТары</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСтоимостиПриобретенияОСПропорциональноОблагаемыхНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводСведенийДляРасчетаСтраховогоСтажа</v8:Type>
						<v8:Type>cfg:DocumentRef.ABCКлассификацияПокупателей</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оповещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПамятнаяДата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ЗадачиПользователя/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
//СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//
# Если Клиент Тогда
// Функция управляет выпадающим списком полей дат
//
Функция ВыборДатыВремениИзВыпадающегоСписка(Элемент, СтандартнаяОбработка, Форма) Экспорт

	СтандартнаяОбработка = Ложь;

	СписокВремен = Новый СписокЗначений;

	Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
		Элемент.Значение = НачалоМинуты(ТекущаяДата());
	КонецЕсли;

	Если ДеньГода(Элемент.Значение) = ДеньГода(ТекущаяДата()) Тогда

		Если Минута(ТекущаяДата()) > 30 Тогда
			ВремяСписка = НачалоМинуты(КонецЧаса(ТекущаяДата()) + 60);
		Иначе
			ВремяСписка = НачалоМинуты(КонецЧаса(ТекущаяДата()) - 29*60);
		КонецЕсли;

	Иначе
		ВремяСписка = НачалоДня(Элемент.Значение);
	КонецЕсли;

	Пока НачалоЧаса(ВремяСписка) < КонецДня(Элемент.Значение) Цикл

		СписокВремен.Добавить(ВремяСписка, Формат(ВремяСписка,"ДФ='дд.ММ.гггг ЧЧ:мм'"));
		ВремяСписка = ВремяСписка + 30*60;

	КонецЦикла;

	ВыбранноеВремя = Форма.ВыбратьИзСписка(СписокВремен, Элемент);

	Возврат ВыбранноеВремя;

КонецФункции // ВыборДатыВремениИзВыпадающегоСписка()
# КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА
//

// Процедура снимает флаг оповещения перед записью завершенной задачи
// или задачи, в которой дата оповещения не определена.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СрокОповещения)
		Или  Выполнена Тогда
		Оповещение = ЛОЖЬ;
	КонецЕсли;
	
	//Дандали В. 15.04.2026 +
	Если Выполнена И НЕ ЗначениеЗаполнено(ДатаИсполнения) Тогда
		ДатаИсполнения = ТекущаяДата();
	КонецЕсли;
	//Дандали В. 15.04.2026 -
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ПриВыполнении".
//
Процедура ПриВыполнении(Отказ)

	ДатаИсполнения = ТекущаяДата();
	Исполнитель    = ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь");

КонецПроцедуры // ПриВыполнении()

// Процедура - обработчик события "ПередВыполнением".
//
Процедура ПередВыполнением(Отказ)

	РаботаСБизнесПроцессами.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);

КонецПроцедуры // ПередВыполнением()

Функция ПолучитьПоследнийНомер() Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗадачиПользователя.НомерЗадачи
		|ИЗ
		|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
		|ГДЕ
		|	КОНЕЦПЕРИОДА(ЗадачиПользователя.Дата, ГОД) = &Дата
		|	И ЗадачиПользователя.НомерЗадачи <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачиПользователя.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", КонецГода(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Число(ВыборкаДетальныеЗаписи.НомерЗадачи);
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции
